#pragma once

#include "IDirect3D9Hook.h"
#include "ShaderBase.h"
#include "VShaderEngine.h"
#include "PShaderEngine.h"
#include "DeviceState.h"
#include <vector>
#include <map>
#include <intrin.h>

#include "SimpleInstrumentedProfiler.h"

// 16 is the maximum number of vertex input streams supported by D3D9
#define MAX_D3D9_STREAMS 16u

class IDirect3D9Hook;
class IDirect3DVertexBuffer9Hook;
class IDirect3DIndexBuffer9Hook;
class IDirect3DVertexShader9Hook;
class IDirect3DPixelShader9Hook;
class IDirect3DVertexDeclaration9Hook;
class IDirect3DSurface9Hook;
class IDirect3DSwapChain9Hook;
class IDirect3DBaseTexture9Hook;
class IDirect3DTexture9Hook;
class IDirect3DCubeTexture9Hook;
class IDirect3DVolumeTexture9Hook;
class IDirect3DStateBlock9Hook;

struct DeclarationSemanticMapping;
struct VStoPSMapping;

#ifdef MULTITHREAD_SHADING
enum workerJobType
{
	vertexShade1Job = 0,

#ifdef RUN_SHADERS_IN_WARPS
	vertexShade4Job,
	//vertexShade16Job,
	//vertexShade64Job,
#endif // #ifdef RUN_SHADERS_IN_WARPS

	VERTEX_SHADE_JOB_MAX,

	pixelShade1Job,
#ifdef RUN_SHADERS_IN_WARPS
	pixelShade4Job,
	pixelShade16Job,
	pixelShade64Job,
#endif // #ifdef RUN_SHADERS_IN_WARPS

	PIXEL_SHADE_JOB_MAX,

	triangleRasterizeJob
};
#endif

struct DebuggableD3DVERTEXELEMENT9
{
	USHORT    Stream;     // Stream index
    USHORT    Offset;     // Offset in the stream in bytes
    D3DDECLTYPE Type : 8;       // Data type
    D3DDECLMETHOD    Method : 8;     // Processing method
    D3DDECLUSAGE    Usage : 8;      // Semantics
    DWORD    UsageIndex : 8; // Semantic index
};
static_assert(sizeof(D3DVERTEXELEMENT9) == sizeof(DebuggableD3DVERTEXELEMENT9), "Error!");

// A debuggable usage type for resource usages
enum DebuggableUsage : DWORD
{
	UsageNone = 0x00000000, // This is a valid usage, it is also the default usage
	UsageRENDERTARGET = D3DUSAGE_RENDERTARGET,
	UsageDEPTHSTENCIL = D3DUSAGE_DEPTHSTENCIL,
	UsageRESERVED0 = 0x00000004,
	UsageWRITEONLY = D3DUSAGE_WRITEONLY,
	UsageSOFTWAREPROCESSING = D3DUSAGE_SOFTWAREPROCESSING,
	UsageDONOTCLIP = D3DUSAGE_DONOTCLIP,
	UsagePOINTS = D3DUSAGE_POINTS,
	UsageRTPATCHES = D3DUSAGE_RTPATCHES,
	UsageNPATCHES = D3DUSAGE_NPATCHES,
	UsageDYNAMIC = D3DUSAGE_DYNAMIC,
	UsageAUTOGENMIPMAP = D3DUSAGE_AUTOGENMIPMAP,
	UsageRESTRICTEDCONTENT = D3DUSAGE_RESTRICTED_CONTENT,
	UsageRESTRICTSHAREDRESOURCEDRIVER = D3DUSAGE_RESTRICT_SHARED_RESOURCE_DRIVER,
	UsageRESTRICTSHAREDRESOURCE = D3DUSAGE_RESTRICT_SHARED_RESOURCE,
	UsageDMAP = D3DUSAGE_DMAP,
	UsageNONSECURE = D3DUSAGE_NONSECURE,
	UsageTEXTAPI = D3DUSAGE_TEXTAPI
};

static inline const bool operator!=(const D3DVIEWPORT9& lhs, const D3DVIEWPORT9& rhs)
{
	return memcmp(&lhs, &rhs, sizeof(D3DVIEWPORT9) ) != 0;
}

struct StreamSource
{
	StreamSource() : vertexBuffer(NULL), streamOffset(0), streamDividerFrequency(1), streamStride(0)
	{
	}

	// This function is used during state block captures to clone this struct (and make sure that pointer-fixups and AddRef() calls properly occur)
	void CopyForCapture(const StreamSource& rhs);

	~StreamSource()
	{
		vertexBuffer = NULL;
		streamOffset = 0;
		streamDividerFrequency = 1;
		streamStride = 0;
	}

	IDirect3DVertexBuffer9Hook* vertexBuffer;
	UINT streamOffset; // This offset is in bytes
	UINT streamDividerFrequency;
	unsigned short streamStride; // This stream stride is in bytes
};

struct StreamDataTypeEndPointers
{
	StreamDataTypeEndPointers()
	{
		ResetEndPointers();
	}

	~StreamDataTypeEndPointers()
	{
		ResetEndPointers();
	}

	inline void ResetEndPointers()
	{
		memset(this, 0, sizeof(*this) );
		dirty = true;
	}

	inline void SetDirty()
	{
#ifdef _DEBUG
		for (unsigned x = 0; x < ARRAYSIZE(dataTypeStreamEnds); ++x)
			dataTypeStreamEnds[x] = NULL;
		streamEndAbsolute = NULL;
#endif
		dirty = true;
	}

	const void* dataTypeStreamEnds[MAXD3DDECLTYPE];
	const BYTE* streamEndAbsolute;
	bool dirty; // The dirty bit can be set either by calling SetStreamSource() on this stream, or by calling SetVertexDeclarataion() with a new decl (or calling SetFVF() with a new FVF, although SetFVF internally calls SetVertexDeclaration)
};

struct TexturePaletteEntry
{
	PALETTEENTRY entries[256];
};

// Guard band clip code bitmasks
#define D3DCS_GBLEFT	0x00001000L
#define D3DCS_GBRIGHT	0x00002000L
#define D3DCS_GBTOP		0x00004000L
#define D3DCS_GBBOTTOM	0x00008000L

struct DeviceState_ShaderRegisters
{ 
	DeviceState_ShaderRegisters()
	{
		memset(this, 0, sizeof(*this) );
	}

	float4 floats[4096]; // 4096 is the maximum number of shader constants per constant buffer in D3D11 and D3D12, which acts as a nice superset of D3D9 functionality. Also we'll need at least 2048 + 64 slots available for supporting D3DRS_INDEXEDVERTEXBLENDENABLE.
	BOOL bools[16];
	int4 ints[16];
};

enum textureStageArgument : DWORD
{
	TA_DIFFUSE = D3DTA_DIFFUSE,
	TA_CURRENT = D3DTA_CURRENT,
	TA_TEXTURE = D3DTA_TEXTURE,
	TA_TFACTOR = D3DTA_TFACTOR,
	TA_SPECULAR = D3DTA_SPECULAR,
	TA_TEMP = D3DTA_TEMP,
	TA_CONSTANT = D3DTA_CONSTANT,

	TA_COMPLEMENT_DIFFUSE = D3DTA_DIFFUSE | D3DTA_COMPLEMENT,
	TA_COMPLEMENT_CURRENT = D3DTA_CURRENT | D3DTA_COMPLEMENT,
	TA_COMPLEMENT_TEXTURE = D3DTA_TEXTURE | D3DTA_COMPLEMENT,
	TA_COMPLEMENT_TFACTOR = D3DTA_TFACTOR | D3DTA_COMPLEMENT,
	TA_COMPLEMENT_SPECULAR = D3DTA_SPECULAR | D3DTA_COMPLEMENT,
	TA_COMPLEMENT_TEMP = D3DTA_TEMP | D3DTA_COMPLEMENT,
	TA_COMPLEMENT_CONSTANT = D3DTA_CONSTANT | D3DTA_COMPLEMENT,

	TA_DIFFUSE_ALPHAREPLICATE = D3DTA_DIFFUSE | D3DTA_ALPHAREPLICATE,
	TA_CURRENT_ALPHAREPLICATE = D3DTA_CURRENT | D3DTA_ALPHAREPLICATE,
	TA_TEXTURE_ALPHAREPLICATE = D3DTA_TEXTURE | D3DTA_ALPHAREPLICATE,
	TA_TFACTOR_ALPHAREPLICATE = D3DTA_TFACTOR | D3DTA_ALPHAREPLICATE,
	TA_SPECULAR_ALPHAREPLICATE = D3DTA_SPECULAR | D3DTA_ALPHAREPLICATE,
	TA_TEMP_ALPHAREPLICATE = D3DTA_TEMP | D3DTA_ALPHAREPLICATE,
	TA_CONSTANT_ALPHAREPLICATE = D3DTA_CONSTANT | D3DTA_ALPHAREPLICATE,

	TA_COMPLEMENT_DIFFUSE_ALPHAREPLICATE = D3DTA_DIFFUSE | D3DTA_COMPLEMENT | D3DTA_ALPHAREPLICATE,
	TA_COMPLEMENT_CURRENT_ALPHAREPLICATE = D3DTA_CURRENT | D3DTA_COMPLEMENT | D3DTA_ALPHAREPLICATE,
	TA_COMPLEMENT_TEXTURE_ALPHAREPLICATE = D3DTA_TEXTURE | D3DTA_COMPLEMENT | D3DTA_ALPHAREPLICATE,
	TA_COMPLEMENT_TFACTOR_ALPHAREPLICATE = D3DTA_TFACTOR | D3DTA_COMPLEMENT | D3DTA_ALPHAREPLICATE,
	TA_COMPLEMENT_SPECULAR_ALPHAREPLICATE = D3DTA_SPECULAR | D3DTA_COMPLEMENT | D3DTA_ALPHAREPLICATE,
	TA_COMPLEMENT_TEMP_ALPHAREPLICATE = D3DTA_TEMP | D3DTA_COMPLEMENT | D3DTA_ALPHAREPLICATE,
	TA_COMPLEMENT_CONSTANT_ALPHAREPLICATE = D3DTA_CONSTANT | D3DTA_COMPLEMENT | D3DTA_ALPHAREPLICATE
};

struct TextureStageState
{
	TextureStageState()
	{
		memset(this, 0, sizeof(*this) );
		SetStageDefaults(0);
	}

	~TextureStageState()
	{
		memset(this, 0, sizeof(*this) );
		SetStageDefaults(0);
	}

	inline void SetStageDefaults(const unsigned stageNum)
	{
		// All of the invalid state indices have their values set to "0xBAADCAFE" in D3D9 under Windows 10
		static const DWORD invalidTypeValue = 0xBAADCAFE;
		for (unsigned x = 0; x < D3DTSS_CONSTANT + 1; ++x)
			stageStateUnion.state[x] = invalidTypeValue;

		if (stageNum == 0)
		{
			stageStateUnion.namedStates.colorOp = D3DTOP_MODULATE;
			stageStateUnion.namedStates.alphaOp = D3DTOP_SELECTARG1;
		}
		else
		{
			stageStateUnion.namedStates.colorOp = D3DTOP_DISABLE;
			stageStateUnion.namedStates.alphaOp = D3DTOP_DISABLE;
		}
		stageStateUnion.namedStates.colorArg1 = TA_TEXTURE;
		stageStateUnion.namedStates.colorArg2 = TA_CURRENT;
		stageStateUnion.namedStates.alphaArg1 = TA_TEXTURE;
		stageStateUnion.namedStates.alphaArg2 = TA_CURRENT;
		stageStateUnion.namedStates.bumpEnvMat00 = 0.0f;
		stageStateUnion.namedStates.bumpEnvMat01 = 0.0f;
		stageStateUnion.namedStates.bumpEnvMat10 = 0.0f;
		stageStateUnion.namedStates.bumpEnvMat11 = 0.0f;
		stageStateUnion.namedStates.texCoordIndex = D3DTSS_TCI_PASSTHRU | stageNum;
		stageStateUnion.namedStates.bumpEnvLScale = 0.0f; // Shouldn't this default to 1.0f instead?
		stageStateUnion.namedStates.bumpEnvLOffset = 0.0f;
		stageStateUnion.namedStates.textureTransformFlags = D3DTTFF_DISABLE;
		stageStateUnion.namedStates.colorArg0 = TA_CURRENT;
		stageStateUnion.namedStates.alphaArg0 = TA_CURRENT;
		stageStateUnion.namedStates.resultArg = TA_CURRENT;
		stageStateUnion.namedStates.constant = D3DCOLOR_ARGB(0, 0, 0, 0);
	}

	union _stageStateUnion
	{
		struct _namedStates
		{
			DWORD padding0; // 0
			D3DTEXTUREOP colorOp; // 1
			textureStageArgument colorArg1; // 2
			textureStageArgument colorArg2; // 3
			D3DTEXTUREOP alphaOp; // 4
			textureStageArgument alphaArg1; // 5
			textureStageArgument alphaArg2; // 6
			float bumpEnvMat00; // 7
			float bumpEnvMat01; // 8
			float bumpEnvMat10; // 9
			float bumpEnvMat11; // 10
			UINT texCoordIndex; // 11
			DWORD emptyAddress; // 12 - Used to be "D3DTSS_ADDRESS" which was of type D3DTEXTUREADDRESS in D3D7. It was a combination of ADDRESSU and ADDRESSV before they were split out - see d3d7types.h
			DWORD emptySamplerStates[9]; // 13 thru 21 (used to be where sampler state data was stored in D3D8 - see d3d8types.h)
			float bumpEnvLScale; // 22
			float bumpEnvLOffset; // 23
			D3DTEXTURETRANSFORMFLAGS textureTransformFlags; // 24
			DWORD emptyAddressW; // 25 - Used to be "D3DTSS_ADDRESSW" in D3D8 - see d3d8types.h
			textureStageArgument colorArg0; // 26
			textureStageArgument alphaArg0; // 27
			textureStageArgument resultArg; // 28
			DWORD emptyUnknown29[3]; // 29 thru 31 - Unknown what these used to be for
			D3DCOLOR constant; // 32
		} namedStates;
		DWORD state[D3DTSS_CONSTANT + 1];
	} stageStateUnion;
	static_assert(sizeof(_stageStateUnion) == sizeof(DWORD) * (D3DTSS_CONSTANT + 1), "Error: Unexpected union size!");
};

struct TexturePaletteState
{
	TexturePaletteState() : currentPaletteIndex(0xFFFF), paletteEntries(NULL)
	{
	}

	void CaptureCopyTexturePaletteState(const TexturePaletteState& rhs)
	{
		currentPaletteIndex = rhs.currentPaletteIndex;
		if (rhs.paletteEntries)
		{
			paletteEntries = new std::vector<TexturePaletteEntry>();
			*paletteEntries = *(rhs.paletteEntries);
		}
		else
			paletteEntries = NULL;
	}

	~TexturePaletteState()
	{
		currentPaletteIndex = 0xFFFF;

		if (paletteEntries)
		{
			paletteEntries->clear();
			delete paletteEntries;
			paletteEntries = NULL;
		}
	}

	unsigned short currentPaletteIndex; // This is a USHORT because the D3D9 spec says that there's a maximum of 64k texture palettes
