#pragma once

#include "IDirect3D9Hook.h"
#include "ShaderBase.h"
#include "VShaderEngine.h"
#include "PShaderEngine.h"
#include <vector>
#include <map>
#include <intrin.h>

#include "SimpleInstrumentedProfiler.h"

// 16 is the maximum number of vertex input streams supported by D3D9
#define MAX_D3D9_STREAMS 16u

class IDirect3D9Hook;
class IDirect3DVertexBuffer9Hook;
class IDirect3DIndexBuffer9Hook;
class IDirect3DVertexShader9Hook;
class IDirect3DPixelShader9Hook;
class IDirect3DVertexDeclaration9Hook;
class IDirect3DSurface9Hook;
class IDirect3DSwapChain9Hook;
class IDirect3DBaseTexture9Hook;
class IDirect3DTexture9Hook;
class IDirect3DCubeTexture9Hook;
class IDirect3DVolumeTexture9Hook;

struct DeclarationSemanticMapping;
struct VStoPSMapping;

#ifdef MULTITHREAD_SHADING
enum workerJobType
{
	vertexShade1Job = 0,

#ifdef RUN_SHADERS_IN_WARPS
	vertexShade4Job,
	//vertexShade16Job,
	//vertexShade64Job,
#endif // #ifdef RUN_SHADERS_IN_WARPS

	VERTEX_SHADE_JOB_MAX,

	pixelShade1Job,
#ifdef RUN_SHADERS_IN_WARPS
	pixelShade4Job,
	pixelShade16Job,
	pixelShade64Job,
#endif // #ifdef RUN_SHADERS_IN_WARPS

	PIXEL_SHADE_JOB_MAX,

	triangleRasterizeJob
};
#endif

struct DebuggableD3DVERTEXELEMENT9
{
	USHORT    Stream;     // Stream index
    USHORT    Offset;     // Offset in the stream in bytes
    D3DDECLTYPE Type : 8;       // Data type
    D3DDECLMETHOD    Method : 8;     // Processing method
    D3DDECLUSAGE    Usage : 8;      // Semantics
    DWORD    UsageIndex : 8; // Semantic index
};
static_assert(sizeof(D3DVERTEXELEMENT9) == sizeof(DebuggableD3DVERTEXELEMENT9), "Error!");

// A debuggable usage type for resource usages
enum DebuggableUsage : long
{
	UsageNone = 0x00000000, // This is a valid usage, it is also the default usage
	UsageRENDERTARGET = D3DUSAGE_RENDERTARGET,
	UsageDEPTHSTENCIL = D3DUSAGE_DEPTHSTENCIL,
	UsageRESERVED0 = 0x00000004,
	UsageWRITEONLY = D3DUSAGE_WRITEONLY,
	UsageSOFTWAREPROCESSING = D3DUSAGE_SOFTWAREPROCESSING,
	UsageDONOTCLIP = D3DUSAGE_DONOTCLIP,
	UsagePOINTS = D3DUSAGE_POINTS,
	UsageRTPATCHES = D3DUSAGE_RTPATCHES,
	UsageNPATCHES = D3DUSAGE_NPATCHES,
	UsageDYNAMIC = D3DUSAGE_DYNAMIC,
	UsageAUTOGENMIPMAP = D3DUSAGE_AUTOGENMIPMAP,
	UsageRESTRICTEDCONTENT = D3DUSAGE_RESTRICTED_CONTENT,
	UsageRESTRICTSHAREDRESOURCEDRIVER = D3DUSAGE_RESTRICT_SHARED_RESOURCE_DRIVER,
	UsageRESTRICTSHAREDRESOURCE = D3DUSAGE_RESTRICT_SHARED_RESOURCE,
	UsageDMAP = D3DUSAGE_DMAP,
	UsageNONSECURE = D3DUSAGE_NONSECURE,
	UsageTEXTAPI = D3DUSAGE_TEXTAPI
};

static inline const bool operator!=(const D3DVIEWPORT9& lhs, const D3DVIEWPORT9& rhs)
{
	return memcmp(&lhs, &rhs, sizeof(D3DVIEWPORT9) ) != 0;
}

struct StreamSource
{
	StreamSource() : vertexBuffer(NULL), streamOffset(0), streamDividerFrequency(D3DSTREAMSOURCE_INDEXEDDATA), streamStride(0)
	{
	}

	~StreamSource()
	{
		vertexBuffer = NULL;
		streamOffset = 0;
		streamDividerFrequency = D3DSTREAMSOURCE_INDEXEDDATA;
		streamStride = 0;
	}

	IDirect3DVertexBuffer9Hook* vertexBuffer;
	UINT streamOffset; // This offset is in bytes
	UINT streamDividerFrequency;
	unsigned short streamStride; // This stream stride is in bytes
};

struct StreamDataTypeEndPointers
{
	StreamDataTypeEndPointers()
	{
		ResetEndPointers();
	}

	~StreamDataTypeEndPointers()
	{
		ResetEndPointers();
	}

	inline void ResetEndPointers()
	{
		memset(this, 0, sizeof(*this) );
		dirty = true;
	}

	inline void SetDirty()
	{
#ifdef _DEBUG
		for (unsigned x = 0; x < ARRAYSIZE(dataTypeStreamEnds); ++x)
			dataTypeStreamEnds[x] = NULL;
		streamEndAbsolute = NULL;
#endif
		dirty = true;
	}

	const void* dataTypeStreamEnds[MAXD3DDECLTYPE];
	const BYTE* streamEndAbsolute;
	bool dirty; // The dirty bit can be set either by calling SetStreamSource() on this stream, or by calling SetVertexDeclarataion() with a new decl (or calling SetFVF() with a new FVF, although SetFVF internally calls SetVertexDeclaration)
};

struct TexturePaletteEntry
{
	PALETTEENTRY entries[256];
};

// Guard band clip code bitmasks
#define D3DCS_GBLEFT	0x00001000L
#define D3DCS_GBRIGHT	0x00002000L
#define D3DCS_GBTOP		0x00004000L
#define D3DCS_GBBOTTOM	0x00008000L

struct DeviceState_ShaderRegisters
{ 
	DeviceState_ShaderRegisters()
	{
		memset(this, 0, sizeof(*this) );
	}

	float4 floats[256]; // 256 is the maximum number of shader constants in both PS_3_0 and VS_3_0
	BOOL bools[16];
	int4 ints[16];
};

struct TextureStageState
{
	TextureStageState()
	{
		memset(this, 0, sizeof(*this) );
		SetStageDefaults();
	}

	~TextureStageState()
	{
		memset(this, 0, sizeof(*this) );
		SetStageDefaults();
	}

	inline void SetStageDefaults(void)
	{
		stageStateUnion.namedStates.colorOp = D3DTOP_DISABLE;
		stageStateUnion.namedStates.colorArg1 = D3DCOLOR_ARGB(0, 0, 0, 0);
		stageStateUnion.namedStates.colorArg2 = D3DCOLOR_ARGB(0, 0, 0, 0);
		stageStateUnion.namedStates.alphaOp = D3DTOP_DISABLE;
		stageStateUnion.namedStates.alphaArg1 = D3DCOLOR_ARGB(0, 0, 0, 0);
		stageStateUnion.namedStates.alphaArg2 = D3DCOLOR_ARGB(0, 0, 0, 0);
		stageStateUnion.namedStates.bumpEnvMat00 = 0.0f;
		stageStateUnion.namedStates.bumpEnvMat01 = 0.0f;
		stageStateUnion.namedStates.bumpEnvMat10 = 0.0f;
		stageStateUnion.namedStates.bumpEnvMat11 = 0.0f;
		stageStateUnion.namedStates.texCoordIndex = 0;
		stageStateUnion.namedStates.bumpEnvLScale = 0.0f; // Shouldn't this default to 1.0f instead?
		stageStateUnion.namedStates.bumpEnvLOffset = 0.0f;
		stageStateUnion.namedStates.textureTransformFlags = D3DTTFF_DISABLE;
		stageStateUnion.namedStates.colorArg0 = D3DCOLOR_ARGB(0, 0, 0, 0);
		stageStateUnion.namedStates.alphaArg0 = D3DCOLOR_ARGB(0, 0, 0, 0);
		stageStateUnion.namedStates.resultArg = D3DTA_CURRENT;
		stageStateUnion.namedStates.constant = D3DCOLOR_ARGB(0, 0, 0, 0);
	}

	inline void SetStage0Defaults(void)
	{
		stageStateUnion.namedStates.colorOp = D3DTOP_MODULATE;
		stageStateUnion.namedStates.alphaOp = D3DTOP_SELECTARG1;
	}

	union _stageStateUnion
	{
		struct _namedStates
		{
			DWORD padding0; // 0
			D3DTEXTUREOP colorOp; // 1
			D3DCOLOR colorArg1; // 2
			D3DCOLOR colorArg2; // 3
			D3DTEXTUREOP alphaOp; // 4
			D3DCOLOR alphaArg1; // 5
			D3DCOLOR alphaArg2; // 6
			float bumpEnvMat00; // 7
			float bumpEnvMat01; // 8
			float bumpEnvMat10; // 9
			float bumpEnvMat11; // 10
			UINT texCoordIndex; // 11
			DWORD emptyAddress; // 12 - Used to be "D3DTSS_ADDRESS" which was of type D3DTEXTUREADDRESS in D3D7. It was a combination of ADDRESSU and ADDRESSV before they were split out - see d3d7types.h
			DWORD emptySamplerStates[8]; // 13 thru 21 (used to be where sampler state data was stored in D3D8 - see d3d8types.h)
			float bumpEnvLScale; // 22
			float bumpEnvLOffset; // 23
			D3DTEXTURETRANSFORMFLAGS textureTransformFlags; // 24
			DWORD emptyAddressW; // 25 - Used to be "D3DTSS_ADDRESSW" in D3D8 - see d3d8types.h
			D3DCOLOR colorArg0; // 26
			D3DCOLOR alphaArg0; // 27
			DWORD resultArg; // 28
			DWORD emptyUnknown29[3]; // 29 thru 31 - Unknown what these used to be for
			D3DCOLOR constant; // 32
		} namedStates;
		DWORD state[D3DTSS_CONSTANT];
	} stageStateUnion;
	static_assert(sizeof(_stageStateUnion) == sizeof(DWORD) * D3DTSS_CONSTANT, "Error: Unexpected union size!");
};

struct TexturePaletteState
{
	TexturePaletteState() : currentPaletteIndex(0), paletteEntries(NULL)
	{
	}

	~TexturePaletteState()
	{
		currentPaletteIndex = 0;

		if (paletteEntries)
		{
			paletteEntries->clear();
			delete paletteEntries;
			paletteEntries = NULL;
		}
	}

	unsigned short currentPaletteIndex; // This is a USHORT because the D3D9 spec says that there's a maximum of 64k texture palettes
	std::vector<TexturePaletteEntry>* paletteEntries;
};

// This is the line pattern struct from D3D8. It is used in the D3DRS_LINEPATTERN (10) render state.
// Header: D3d8types.h
/* This structure describes a line pattern.
These values are used by the D3DRS_LINEPATTERN render state in the D3DRENDERSTATETYPE enumerated type.
A line pattern specifies how a line is drawn. The line pattern is always the same, no matter where it is started. (This differs from stippling, which affects how objects are rendered; that is, to imitate transparency.)
The line pattern specifies up to a 16-pixel pattern of on and off pixels along the line. The wRepeatFactor member specifies how many pixels are repeated for each entry in wLinePattern. */
typedef struct _D3DLINEPATTERN
{
	WORD wRepeatFactor; // Number of times to repeat each series of 1s and 0s specified in the wLinePattern member. This allows an application to stretch the line pattern.
	WORD wLinePattern; // Bits specifying the line pattern. For example, the following value would produce a dotted line: 1100110011001100.
} D3DLINEPATTERN;

// This is from d3dtypes.h
typedef LONG D3DFIXED;

// This is from d3dtypes.h
typedef enum _D3DANTIALIASMODE
{
    D3DANTIALIAS_NONE          = 0,
    D3DANTIALIAS_SORTDEPENDENT = 1,
    D3DANTIALIAS_SORTINDEPENDENT = 2,
    D3DANTIALIAS_FORCE_DWORD   = 0x7fffffff, /* force 32-bit size enum */
} D3DANTIALIASMODE;

// This corresponds to the SetROP2 GDI function's mix modes. The default D3D render state value is R2_COPYPEN. Read here for more info: https://docs.microsoft.com/en-us/windows/desktop/api/wingdi/nf-wingdi-setrop2
typedef DWORD ROP2;

// This is from d3dtypes.h
// Note that the values do *not* line up with the D3D9 D3DTEXTUREFILTERTYPE enum after 2!
typedef enum _D3DTEXTUREFILTER
{
    D3DFILTER_NEAREST          = 1,
    D3DFILTER_LINEAR           = 2,
    D3DFILTER_MIPNEAREST       = 3,
    D3DFILTER_MIPLINEAR        = 4,
    D3DFILTER_LINEARMIPNEAREST = 5,
    D3DFILTER_LINEARMIPLINEAR  = 6,
#if(DIRECT3D_VERSION >= 0x0500)
    D3DFILTER_FORCE_DWORD      = 0x7fffffff, /* force 32-bit size enum */
#endif /* DIRECT3D_VERSION >= 0x0500 */
} D3DTEXTUREFILTER;

// This is from d3dtypes.h
typedef enum _D3DTEXTUREBLEND
{
    D3DTBLEND_DECAL            = 1,
    D3DTBLEND_MODULATE         = 2,
    D3DTBLEND_DECALALPHA       = 3,
    D3DTBLEND_MODULATEALPHA    = 4,
    D3DTBLEND_DECALMASK        = 5,
    D3DTBLEND_MODULATEMASK     = 6,
    D3DTBLEND_COPY             = 7,
#if(DIRECT3D_VERSION >= 0x0500)
    D3DTBLEND_ADD              = 8,
    D3DTBLEND_FORCE_DWORD      = 0x7fffffff, /* force 32-bit size enum */
#endif /* DIRECT3D_VERSION >= 0x0500 */
} D3DTEXTUREBLEND;

// This is from d3dtypes.h
typedef float D3DVALUE;

// All of the render states available via SetRenderState() and GetRenderState()
// Reference for the D3D9-supported ones: https://msdn.microsoft.com/en-us/library/windows/desktop/bb172599(v=vs.85).aspx
__declspec(align(16) ) struct RenderStates
{
	RenderStates();

	~RenderStates()
	{
		memset(this, 0, sizeof(*this) );
	}

#define MAX_NUM_RENDERSTATES (D3DRS_BLENDOPALPHA + 1)

	union _renderStatesUnion
	{
		struct _namedStates
		{
			DWORD empty0; // 0
			DWORD textureHandle_D3D1; // 1 (only used in D3D1 thru D3D6)
			D3DANTIALIASMODE antialias_D3D5; // 2 (only used in D3D5, D3D6, and D3D7)
			D3DTEXTUREADDRESS textureAddress_D3D1; // 3 (only used in D3D1 thru D3D6)
			BOOL texturePerspective_D3D1; // 4 (only used in D3D1 thru D3D7)
			BOOL wrapU_D3D1; // 5 (only used in D3D1 thru D3D6)
			BOOL wrapV_D3D1; // 6 (only used in D3D1 thru D3D6)
			D3DZBUFFERTYPE zEnable; // 7
			D3DFILLMODE fillmode; // 8
			D3DSHADEMODE shadeMode; // 9
			D3DLINEPATTERN linePattern_D3D1; // 10 (only used in D3D1 thru D3D8)
			BOOL monoEnable_D3D1; // 11 (only used in D3D1 thru D3D6)
			ROP2 rop2_D3D1; // 12 (only used in D3D1 thru D3D6)
			DWORD planeMask_D3D1; // 13 (only used in D3D1 thru D3D6)
			BOOL zWriteEnable; // 14
			BOOL alphaTestEnable; // 15
			BOOL lastPixel; // 16
			D3DTEXTUREFILTER textureMag_D3D1; // 17 (only used in D3D1 thru D3D6, replaced with SetTextureStageState() in D3D7 and D3D8, then replaced with SetSamplerState() in D3D9)
			D3DTEXTUREFILTER textureMin_D3D1; // 18 (only used in D3D1 thru D3D6, replaced with SetTextureStageState() in D3D7 and D3D8, then replaced with SetSamplerState() in D3D9)
			D3DBLEND srcBlend; // 19
			D3DBLEND destBlend;// 20
			D3DTEXTUREBLEND textureMapBlend_D3D1; // 21 (only used in D3D1 thru D3D6)
			D3DCULL cullmode; // 22
			D3DCMPFUNC zFunc; // 23
			D3DFIXED alphaRef; // 24
			D3DCMPFUNC alphaFunc; // 25
			BOOL ditherEnable; // 26
			BOOL alphaBlendEnable; // 27 (D3D5+ only)
			BOOL fogEnable; // 28
			BOOL specularEnable; // 29
			BOOL zVisible_D3D1; // 30 (only used in D3D1 thru D3D8, seems to do a very similar thing as D3DRS_ZENABLE?)
			BOOL subPixel_D3D1; // 31 (only used in D3D1 thru D3D6)
			BOOL subPixelX_D3D1; // 32 (only used in D3D1 thru D3D6)
			BOOL stippledAlpha_D3D1; // 33 (only used in D3D1 thru D3D7)
			D3DCOLOR fogColor; // 34
			D3DFOGMODE fogTableMode; // 35
			float fogStart; // 36 (only used in D3D7+)
			float fogEnd; // 37 (only used in D3D7+)
			float fogDensity; // 38 (only used in D3D7+)
			BOOL stippleEnable_D3D1; // 39 (only used in D3D1 thru D3D6)
			BOOL edgeAntialias_D3D5; // 40 (only used in D3D5 thru D3D8)
			BOOL colorKeyEnable_D3D5; // 41 (only used in D3D5, D3D6, and D3D7)
			DWORD oldAlphaBlendEnable_D3D1; // 42 (only used in D3D1 thru D3D6, replaced with D3DRS_ALPHABLENDENABLE in D3D7+)
			D3DCOLOR borderColor_D3D5; // 43 (only used in D3D5 and D3D6, replaced with SetTextureStageState() in D3D7+)
			D3DTEXTUREADDRESS textureAddressU_D3D5; // 44 (only used in D3D5 and D3D6, replaced with SetTextureStageState() in D3D7 and D3D8, then replaced with SetSamplerState() in D3D9)
			D3DTEXTUREADDRESS textureAddressV_D3D5; // 45 (only used in D3D5 and D3D6, replaced with SetTextureStageState() in D3D7 and D3D8, then replaced with SetSamplerState() in D3D9)
			D3DVALUE mipMapLoDBias_D3D5; // 46 (only used in D3D5 and D3D6, replaced with SetTextureStageState() in D3D7 and D3D8, then replaced with SetSamplerState() in D3D9)
			LONG zBias_D3D8; // 47 (only used in D3D5 thru D3D8)
			BOOL rangeFogEnable; // 48 (D3D5+ only)
			DWORD maxAnisotropy_D3D5; // 49 (only used in D3D5 and D3D6, replaced with SetTextureStageState() in D3D7 and D3D8, then replaced with SetSamplerState() in D3D9)
			BOOL flushBatch_D3D5; // 50 (D3D5 only)
			BOOL translucentSortIndependent_D3D6; // 51 (D3D6 only)
			BOOL stencilEnable; // 52 (D3D6+ only)
			D3DSTENCILOP stencilFail; // 53 (D3D6+ only)
			D3DSTENCILOP stencilZFail; // 54 (D3D6+ only)
			D3DSTENCILOP stencilPass; // 55 (D3D6+ only)
			D3DCMPFUNC stencilFunc; // 56 (D3D6+ only)
			UINT stencilRef; // 57 (D3D6+ only)
			DWORD stencilMask; // 58 (D3D6+ only)
			DWORD stencilWriteMask; // 59 (D3D6+ only)
			D3DCOLOR textureFactor; // 60 (D3D6+ only)
			DWORD empty61[3]; // 61 thru 63
			DWORD stipplePattern[32]; // 64 thru 95 (D3D1 thru D3D6 only)
			DWORD empty96[32]; // 96 thru 127
			DWORD wrap0; // 128 (D3D6+ only) (This used to be "D3DRENDERSTATE_WRAPBIAS" in D3D6)
			DWORD wrap1; // 129	(D3D6+ only)
			DWORD wrap2; // 130	(D3D6+ only)
			DWORD wrap3; // 131	(D3D6+ only)
			DWORD wrap4; // 132	(D3D6+ only)
			DWORD wrap5; // 133	(D3D6+ only)
			DWORD wrap6; // 134	(D3D6+ only)
			DWORD wrap7; // 135	(D3D6+ only)
			BOOL clipping; // 136 (D3D7+ only)
			BOOL lighting; // 137 (D3D7+ only)
			BOOL extents_D3D7; // 138 (D3D7 only)
			D3DCOLOR ambient; // 139 (D3D7+ only)
			D3DFOGMODE fogVertexMode; // 140 (D3D7+ only)
			BOOL colorVertex; // 141 (D3D7+ only)
			BOOL localViewer; // 142 (D3D7+ only)
			BOOL normalizeNormals; // 143 (D3D7+ only)
			BOOL colorKeyBlendEnable_D3D7; // 144 (D3D7 only)
			D3DMATERIALCOLORSOURCE diffuseMaterialSource; // 145 (D3D7+ only)
			D3DMATERIALCOLORSOURCE specularMaterialSource; // 146 (D3D7+ only)
			D3DMATERIALCOLORSOURCE ambientMaterialSource; // 147 (D3D7+ only)
			D3DMATERIALCOLORSOURCE emissiveMaterialSource; // 148 (D3D7+ only)
			DWORD empty149[2]; // 149 and 150
			D3DVERTEXBLENDFLAGS vertexBlend; // 151 (D3D7+ only)
			DWORD clipPlaneEnable; // 152 (D3D7+ only)
			BOOL softwareVertexProcessing_D3D8; // 153 (only used in D3D8, replaced with IDirect3DDevice9::SetSoftwareVertexProcessing() in D3D9)
			float pointSize; // 154
			float pointSize_Min; // 155
			BOOL pointSpriteEnable; // 156
			BOOL pointScaleEnable; // 157
			float pointScale_A; // 158
			float pointScale_B; // 159
			float pointScale_C; // 160
			BOOL multisampleAntialias; // 161
			DWORD multisampleMask; // 162
			D3DPATCHEDGESTYLE patchEdgeStyle; // 163
			DWORD patchSegments_D3D8; // 164 (only used in D3D8)
			D3DDEBUGMONITORTOKENS debugMonitorToken; // 165
			float pointSize_Max; // 166
			BOOL indexedVertexBlendEnable; // 167
			DWORD colorWriteEnable; // 168
			DWORD empty169; // 169
			float tweenFactor; // 170
			D3DBLENDOP blendOp; // 171
			D3DDEGREETYPE positionDegree; // 172 (in D3D8 this was called "D3DRS_POSITIONORDER")
			D3DDEGREETYPE normalDegree; // 173 (in D3D8 this was called "D3DRS_NORMALORDER")
			BOOL scissorTestEnable; // 174
			float slopeScaledDepthBias; // 175
			BOOL antialiasedLineEnable; // 176
			DWORD empty177; // 177
			float minTessellationLevel; // 178
			float maxTessellationLevel; // 179
			float adaptiveness_X; // 180
			float adaptiveness_Y; // 181
			float adaptiveness_Z; // 182
			float adaptiveness_W; // 183
			BOOL enableAdaptiveTessellation; // 184
			BOOL twoSidedStencilMode; // 185
			D3DSTENCILOP ccw_StencilFail; // 186
			D3DSTENCILOP ccw_StencilZFail; // 187
			D3DSTENCILOP ccw_StencilPass; // 188
			D3DCMPFUNC ccw_StencilFunc; // 189
			DWORD colorWriteEnable1; // 190
			DWORD colorWriteEnable2; // 191
			DWORD colorWriteEnable3; // 192
			D3DCOLOR blendFactor; // 193
			BOOL sRGBWriteEnable; // 194
			float depthBias; // 195
			DWORD empty196[2]; // 196 and 197
			DWORD wrap8; // 198
			DWORD wrap9; // 199
			DWORD wrap10; // 200
			DWORD wrap11; // 201
			DWORD wrap12; // 202
			DWORD wrap13; // 203
			DWORD wrap14; // 204
			DWORD wrap15; // 205
			BOOL separateAlphaBlendEnable; // 206
			D3DBLEND srcBlendAlpha; // 207
			D3DBLEND destBlendAlpha; // 208
			D3DBLENDOP blendOpAlpha; // 209
		} namedStates;
		DWORD states[MAX_NUM_RENDERSTATES];
	} renderStatesUnion;
	static_assert(sizeof(_renderStatesUnion) == sizeof(DWORD) * MAX_NUM_RENDERSTATES, "Error: Unexpected union size!");

	// Cache some derived values from SetRenderState() for more efficient runtime usage:
	__declspec(align(16) ) float cachedAlphaRefFloat;
	__declspec(align(16) ) D3DXVECTOR4 cachedAmbient;
	__declspec(align(16) ) D3DXVECTOR4 cachedBlendFactor;
	__declspec(align(16) ) D3DXVECTOR4 cachedInvBlendFactor;
	__declspec(align(16) ) __m128 depthBiasSplatted;
	__declspec(align(16) ) __m128 alphaRefSplatted;
};

__declspec(align(16) ) struct Transforms
{
#define MAX_WORLD_TRANSFORMS 256

	Transforms() : wvpDirty(true)
	{
		memset(this, 0, sizeof(*this) );

		static const unsigned numTransformsTotal = sizeof(*this) / sizeof(D3DXMATRIXA16);
		for (unsigned x = 0; x < numTransformsTotal; ++x)
		{
			D3DXMatrixIdentity(&ViewTransform + x);
		}
	}
